/* No comment provided by engineer. */
"About Verbatim Solutions" = "A Verbatim Solutions röviden";

/* No comment provided by engineer. */
"Verbi™ powered by Verbatim Solutions" = "A Verbi™ üzemeltetője a  Verbatim Solutions";

/* No comment provided by engineer. */
"Tap here to begin typing.." = "Finoman üssön ide a beírás megkezdéséhez";

/* No comment provided by engineer. */
"All translation history has been cleared." = "A teljes fordítási előzmény törölve.";

/* No comment provided by engineer. */
"Are you sure you want to clear all translation history?  Your previous translations will not show up as suggestions anymore." = "Biztos abban, hogy a teljes fordítási előzményt törölni kívánja? Korábbi fordításai így nem jelennek majd meg javaslatként.";

/* No comment provided by engineer. */
"Cancel" = "Mégse";

/* No comment provided by engineer. */
"Clear" = "Törlés";

/* No comment provided by engineer. */
"Clear Translation History" = "Fordítási előzmények törlése";

/* No comment provided by engineer. */
"Done" = "Kész";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Professional Quote" = "Szakszerű fordítás árajánlata";

/* No comment provided by engineer. */
"Request Professional Quote" = "Ajánlatkérés szakszerű fordításra";

/* No comment provided by engineer. */
"Submitting.." = "Benyújtás…";

/* No comment provided by engineer. */
"Translating.." = "Fordítás folyamatban";

/* No comment provided by engineer. */
"Verbi™ is powered by Verbatim Solutions, a leading professional translation services provider.  Verbi™ provides you quick machine translations and is not a substitute for certified, professional translation services.  For a professional translation provided by one of our certified translators please contact us at" = "Verbi™üzemeltetője a Verbatim Solutions, a szakszerű fordítások vezető szolgáltatója.  A Verbi ™ gyors gépi fordítást biztosít és nem helyettesíti a hitelesített, szakszerű fordítási szolgáltatást.  Amennyiben szakszerű fordítást szeretne rendelni valamelyik hitelesített fordítónktól, kérjük, lépjen kapcsolatba velünk";

/* No comment provided by engineer. */
"Mail:" = "Levélben:";

/* No comment provided by engineer. */
"Call:" = "Hívjon:";

/* No comment provided by engineer. */
"Online:" = "Online:";

/* No comment provided by engineer. */
"Verbi™ Translate" = "Verbi™ Fordító";

/* No comment provided by engineer. */
"We're sorry, an error has occurred.  Please try again." = "Sajnáljuk, hiba történt. Próbálja meg újra.";

/* No comment provided by engineer. */
"An internet connection is required to continue." = "An internet connection is required to continue.";

/* No comment provided by engineer. */
"We're missing a background for the selected language. Please restart the application.  If the problem persists, please uninstall and re-install." = "We're missing a background for the selected language. Please restart the application.  If the problem persists, please uninstall and re-install.";

/* No comment provided by engineer. */
"Missing theme information for '%'. Please close and restart.  If this problem continues, please uninstall and re-install." = "Missing theme information for '%'. Please close and restart.  If this problem continues, please uninstall and re-install.";